main_welcome = """
*🌟 Добро пожаловать в Unicode — самое лучшее IT сообщество на свете! 🌐*

🤖 Этот бот является твоим навигатором по вселенной Unicode, координируя работу всех сервисов, предоставляя доступ к чатам и многое другое. Всё, что тебе нужно, собрано в одном месте!

*🟣 Выбери, что тебя интересует 👇*
""" #TODO ок ли то, что палец показывает непонятно куда?


mentors_welcome = """
*База Менторов Unicode*

*🔍 Найди идеального ментора* для индивидуальных занятий по своему направлению!

*🌍 Доступ к базе открыт для всех* — ищи ментора, который подойдет именно тебе!

*🙋‍♂️ Если ты хочешь* сам стать ментором, тебе нужно заполнить анкету ментора и вступить в специальный чат.
""" #TODO спросить что за чат, мб стоит указать сразу какой тип подписки нужен?


mentors_instructions = """
*📝 Стань Ментором в Сообществе Unicode*

Чтобы стать ментором, тебе необходимо заполнить анкету ментора. Вот ключевые правила, которые следует соблюдать:

*1️⃣ Быть на связи:* Отвечай людям в Telegram, поддерживай активное общение.

*2️⃣ Специализация:* Тема твоего менторства должна быть связана с IT и полностью законной.

*3️⃣ Уважение:* Относись с уважением к обратившимся к тебе людям. Но ты не обязан предоставлять бесплатные консультации.

🚀 Если согласен, пора заполнить анкету ментора
"""


knowdledge_base_welcome = """
*🔒 Эта база знаний содержит в себе секретные знания 🔒*
которые помогут тебе прокачать свой скилл и устроиться на работу мечты

🚀 Всего есть 3 раздела:

*1️⃣ База вопросов* — список вопросов из реальных собеседований по темам.

*2️⃣ Полезные материалы* — все самые полезные ссылки, которыми делятся наши участники.

*3️⃣ Резюме собесов* — краткие содержания собеседований в самые разные компании.

*‼️ Для доступа к базе нужно быть подписанным на сообщество и пройти авторизацию через Telegram.*

*‼️ Базу вопросов пополняют САМИ участники сообщества Unicode.* Прежде чем нажимать на кнопку "Пополнить базу", обязательно посмотри [это видео](пока что пустая ссылка).

*🤝 Взаимопомощь — наш принцип.* Помогая друг другу, мы делаем сообщество Unicode сильнее. Поделись своим опытом или полезной находкой с участниками.
""" # TODO нужна ссылка на видео


networkingbot_welcome = """
*🤖 Бот для IT знакомств — эксклюзивный бот для участников сообщества Unicode.*

В этом боте ты сможешь познакомиться с другими участниками сообщества и найти:

🤝 Новых друзей
🚀 Тиммейтов для совместных проектов
💖 Или кого-то особенного 😉

🌐 Ограничений на темы знакомств нет — общайся, обменивайся идеями, находи единомышленников и расширяй свой кругозор в мире IT.

🔑 Бот доступен для подписчиков уровня *🟣 Unicode Base* и выше.
"""


active_chats = """Список активных чатов:
[UNI: ФЛУДИЛКА](https://t.me/+Pphu6iu6VGwwYmRi) (основной чат)
[UNI: резюме](https://t.me/+vLW1bN_CDE5iZWM6)
[UNI: python](https://t.me/+3iec-KVDof4wZGIy)
[UNI: data science](https://t.me/+-yVI9LU9klk2ZjJi)
[UNI: база знаний](https://t.me/+UWs3Kbqu6uUzNWZi)
"""


error_no_subscr_for_chats = """🔒 Чаты доступны для уровня подписки 👤 Unicode Guest и выше. Чтобы получить доступ к чатам, оформи подписку."""


error_no_subscr_for_mentors_base = """🚫 Извини, но заполнение анкеты ментора доступно начиная с подписки *🟣 Unicode Base.*"""

error_no_subscr_for_knowdledge_base = """🚫 Извини, но пополнение базы знаний доступно начиная с подписки *🟣 Unicode Base.*"""

active_chats_no_links = """
📋 Список основных чатов:
• UNI: ФЛУДИЛКА (основной чат)
• UNI: резюме
• UNI: python
• UNI: data science
• UNI: база знаний

🔒 Чаты доступны для уровня подписки *👤 Unicode Guest* и выше. Чтобы получить доступ к чатам, оформи подписку.
"""

subscriptions_welcome = """
🌈 Пожалуйста, выбери тип подписки, который тебя интересует:

*👤 Unicode Guest (99 ₽/мес)*

• Доступ в основные чаты сообщества

*🟣 Unicode Base (499 ₽/мес)*

• Доступ в основные чаты сообщества
• Доступ к базе знаний
• Доступ к боту для знакомств
• Доступ к размещению в таблице менторов

*👉 Выбери интересующий тебя вариант подписки*
""" # TODO думаю еще важно указать какие закрытые видео будут доступны для каждого варианта


subscription_type_info_with_time = """
✅ Твоя подписка: {subscription_type}

📆 Подписка действительна до: {subscription_end}

🔄 Хочешь улучшить или отменить подписку?
"""

subscription_type_info = """
✅ Твоя подписка: {subscription_type}

🔄 Хочешь улучшить или отменить подписку?
"""

unicode_guest_info = """
*С подпиской 👤 Unicode Guest ты получаешь:*

🗣 Доступ к чатам сообщества.
"""

unicode_base_info = """
*С подпиской 🟣 Unicode Base ты получаешь:*

🗣 Доступ к чатам сообщества.

📚 Доступ к базе знаний.

💑 Доступ к боту для знакомств.

🏅 Доступ к размещению в таблице менторов.
"""

cancel_subscription = """
*❓ Ты уверен, что хочешь отменить свою подписку?*

Текущая подписка будет действовать до *{subscription_end}*.
"""

link_to_mentors_base = """https://airtable.com/apphMruCEJJG0UCT5/shr71I9PGXzSNOND5"""

link_to_questions_base = """https://baza.unicode.club/"""

link_to_networking_bot = """https://t.me/unicode_coffee_bot"""
