main_welcome = """Добро пожаловать в Unicode, самое активное IT сообщество на свете! Этот бот координирует работу всех сервисов Unicode, даёт доступ к чатам и т.д. В общем всё в одном месте. Пожалуйста, выбери что тебя интересует."""

mentors_welcome = """В базе менторов ты сможешь подобрать себе ментора для индивидуальных занятий, либо самому стать ментором, заполнив анкету ментора. 

Доступ к базе менторов есть у всех людей в интернете, но размещаться здесь могут только участники сообщества Unicode.
"""


mentors_instructions = """Для того чтобы стать ментором, тебе нужно заполнить анкету ментора.

Правила, которые необходимо соблюдать менторам:

1️⃣ Быть на связи, отвечать людям в тг
2️⃣ Тема вашего менторства должна относиться к IT и быть законной
3️⃣ Вы должны уважительно относиться к людям, которые к вам обращаются
(но не обязаны давать бесплатные консультации)"""


questions_welcome = """Эта база знаний содержит в себе секретные знания, которые помогут
тебе прокачать свой скилл и устроиться на работу.

Всего есть 3 раздела:
База вопросов -- список вопросов из реальных собеседований по темам
Полезные материалы -- все самые полезные ссылки, которыми делятся наши участники
Резюме собесов -- краткие содержания собеседований в самые разные компании

❗️❗️ Для доступа к базе нужно быть подписанным на сообщество и пройти авторизацию через телеграм.

❗️❗️ Базу вопросов пополняют САМИ участники сообщество Unicode. Прежде чем нажимать на кнопку "Пополнить базу", обязательно посмотри [это видео](пока что пустая ссылка)
"""


networkingbot_welcome = """Бот для IT знакомств - эксклюзивный бот для участников сообщества Unicode.

В нём ты сможешь познакомиться с другими участниками сообщества и найти себе друзей, тиммейтов, или кого-то ещё.😉 Ограничений на темы знакомств нет."""



active_chats = """Список активных чатов:
[UNI: ФЛУДИЛКА](https://t.me/+Pphu6iu6VGwwYmRi) (основной чат)
[UNI: резюме](https://t.me/+vLW1bN_CDE5iZWM6)
[UNI: python](https://t.me/+3iec-KVDof4wZGIy)
[UNI: data science](https://t.me/+-yVI9LU9klk2ZjJi)
[UNI: база знаний](https://t.me/+UWs3Kbqu6uUzNWZi)
"""

error_no_subscr_for_chats = """Чаты доступны только для участников сообщества Unicode. 
Чтобы получить доступ к чатам, оформи подписку.
"""

error_no_subscr_for_mentors_base = """Извини, но стать ментором могут только участники сообщества Unicode. 
Тебе необходимо оформить подписку
"""

active_chats_no_links = """Список активных чатов:
UNI: ФЛУДИЛКА (основной чат)
UNI: резюме
UNI: python
UNI: data science
UNI: база знаний
"""


# TODO заменить ссылку на нормальную
link_to_mentors_base = """[Редирект на таблицу менторов](https://www.youtube.com/watch?v=dQw4w9WgXcQ)"""

link_to_questions_base = """[Редирект на базу вопросов](baza.unicode.club)"""

link_to_networking_bot = """[Редирект в бота для IT-знакомств](https://t.me/unicode_coffee_bot)"""
