main_welcome = """
🌟 *Добро пожаловать в Unicode*  — молодое IT сообщество, основной целью которого является твоё карьерное развитие в профессиональном и денежном плане.

Сообщество включает:

🟣 *Приватный телеграм канал* с эксклюзивным контентом (собеседования, мысли, лайфхаки, полезные посты). Всё о чём нельзя говорить на широкую публику. *Весь контент тут!* — весь контент с [бусти](https://boosty.to/gernar), + дополнительный.

💭 *Чаты сообщества.* Здесь ты можешь получить ответы на все свои вопросы, пообщаться с реальными специалистами в своей области и улучшить своё резюме!

📚 *База знаний.* Все знания сообщества собраны в одном месте: вопросы с реальных собеседований, полезные материалы, резюме собесов в различные компании! База пополняется участниками сообщества Unicode.

🏅 *Таблица менторов.* Здесь ты найдёшь идеального ментора для индивидуальных занятий по своему направлению! Если сам хочешь стать ментором, ты сможешь добавить себя в эту таблицу.

*Выбери, что тебя интересует* 👇
"""

# 🤝 *Бот для IT знакомств.* Создай свою анкету и просматривай анкеты других участников. Знакомься, заводи новых друзей, получай полезные контакты! # TODO включить когда будет нужно

not_text_message = """🙏🏻 Пожалуйста, пришли всё необходимое текстовым сообщением. Туда ты можешь вставить ссылки на все необходимые материалы."""
