welcome_knowledge_base = """
📚 *База знаний* содержит уникальные знания, которые помогут тебе прокачать свой скилл и устроиться на работу мечты.

🚀 Всего есть 3 раздела:

1️⃣ *База вопросов* — список вопросов из реальных собеседований по темам.

2️⃣ *Полезные материалы* — все самые полезные ссылки, которыми делятся наши участники.

3️⃣ *Резюме собесов* — краткие содержания собеседований в самые разные компании.

💡 Базу вопросов пополняют *сами участники* сообщества Unicode. Её существование -- результат коллективного труда.

🤝 *Взаимопомощь — наш принцип.* Помогая друг другу, мы делаем сообщество Unicode сильнее. Поделись своим опытом или полезной находкой с участниками.
"""

add_for_unsubscribers = """🔒 Для доступа к базе нужно *оформить соответствующую подписку* на сообщество Unicode."""


ask_which_to_send = """Выбери, что ты хочешь прислать"""

##### РАЗДЕЛ "ВОПРОСЫ С СОБЕСЕДОВАНИЯ" #####
ask_interview_position = """Пожалуйста, напиши на какую должность ты хочешь прислать вопросы (например: `Python Developer`, `IOS Developer`, `Data Science` etc.)"""

ask_interview_questions = """Теперь пришли сам список вопросов одним сообщением"""

feedback_after_interview = """🔍 Модераторы проверят вопросы и внесут их в базу. Спасибо, что вносишь вклад в наше сообщество! 💜"""

##### РАЗДЕЛ "ПОЛЕЗНЫЕ МАТЕРИАЛЫ" #####
ask_materials_descr = """Пожалуйста, опиши, что за материалы ты хочешь прислать"""

ask_materials_info = """Теперь пришли ссылку (можно несколько, но одним сообщением)"""

feedback_after_materials = """🔗 Модераторы проверят твои ссылки и внесут в базу. Спасибо, что вносишь вклад в наше сообщество! 💜"""

##### РАЗДЕЛ "РЕЗЮМЕ СОБЕСА" #####
ask_summary_position = """Пожалуйста, напиши на какую должность ты хочешь прислать выжимку (например: `Python Developer`, `IOS Developer`, `Data Science` etc.)"""

ask_summary_company = """В какую компанию это собеседование?"""

ask_summary = """Теперь пришли выжимку собеседования одним сообщением"""

feedback_after_summary = """🔍 Модераторы проверят вопросы и внесут их в базу. Спасибо, что вносишь вклад в наше сообщество! 💜"""

##### РАЗДЕЛ "ДРУГОЕ" #####
ask_other_info = """Пожалуйста, пришли всю необходимую информацию одним сообщением"""

feedback_after_other = """🔍 Модераторы проверят информацию и внесут её в базу. Спасибо, что вносишь вклад в наше сообщество! 💜"""
