welcome_mentors_table = """
🏅 *Таблица менторов* — место, где можно найти идеального ментора для индивидуальных занятий по своему направлению!

🌍 Доступ к таблице *открыт для всех* — ищи ментора, который подойдет именно тебе!

🙋‍♂️ Если ты хочешь *стать ментором* и попасть в таблицу, тебе нужно *оформить подписку* на сообщество и заполнить анкету ментора.
"""

mentor_in_table = """🤔 Твоя анкета уже есть в таблице менторов. Что хочешь с ней сделать?"""

become_mentor_instructions = """
📝 Чтобы стать ментором, тебе необходимо *заполнить анкету ментора и дождаться одобрения модераторов*. Вот ключевые правила, которые тебе нужно будет соблюдать:

1️⃣ *Быть на связи*: отвечай людям в Telegram, поддерживай активное общение.

2️⃣ *Специализация*: тема твоего менторства должна быть связана с IT и карьерным ростом.

3️⃣ *Уважение*: относись с уважением к обратившимся к тебе людям, но это не обязывает тебя давать бесплатные консультации.

🚀 Если ты принимаешь эти правила, пора заполнить анкету!
"""

confirm_delete_mentor = "❓ Ты точно хочешь удалить свою анкету из таблицы менторов?"

successful_delete = "✅ Твоя анкета успешно удалена!"

ask_mentor_name = "Как к тебе обращаться?"

ask_mentor_area = "По какой теме ты консультируешь?"

ask_mentor_descr = "Пришли подробное описание своей услуги. Если хочешь, можешь прислать ссылку на страницу с подробным описанием."

ask_mentor_price = "Напиши цену своей услуги"

ask_mentor_contact = "Как люди будут с тобой связываться? Оставь  контакты, либо пришли ссылку."

successful_fill_mentor = "✅ Отлично! Твоя анкета отправлена на модерацию."
