welcome_networking_bot = """
🤖 *Бот для IT знакомств* — эксклюзивный бот для нетворкинга участников сообщества Unicode.

В этом боте ты сможешь создать свою анкету и просматривать анкеты других участников сообщества, чтобы найти:

🤝 Новых друзей
🚀 Тиммейтов для совместных проектов
💖 Или кого-то особенного 😉

🌐 *Ограничений на темы знакомств нет* — общайся, обменивайся идеями, находи единомышленников и расширяй свой кругозор в мире IT.
"""

add_for_unsubscribers = """🔒 Для доступа к боту тебе нужно *оформить соответствующую подписку* на сообщество Unicode."""
