private_channel_welcome = """
🟣 *Приватный телеграм канал* — канал [Вадима Новосёлова](https://www.youtube.com/@gernar228), создателя сообщества Unicode. Весь платный контент публикуется здесь: собеседования, мысли, лайфхаки, посты о карьерном и личностном росте и многое другое.

🚀 *Весь* платный контент выходит здесь!

🔶 Основной контент из этого телеграм канала *дублируется* в [Boosty](https://boosty.to/gernar), но личные мысли Вадима, кружки и голосовые *не дублируются!*
"""

add_for_unsubscribers = """🔒 Для доступа к каналу нужно оформить соответствующую подписку на сообщество Unicode."""
