welcome_subscribe = """
❌ *Твоя подписка неактивна*

_Подписка включает в себя_:

🗣 Доступ к чатам сообщества.

📚 Доступ к базе знаний.

🏅 Доступ к размещению в [таблице менторов](https://clck.ru/39k7Wv).

Для оформления нажми _«Оплатить подписку»_
"""

choice_type_subscr = """👉 *Выбери интересующий тебя вариант подписки*"""

choice_update_or_break_subscr = """🔄 *Хочешь изменить или отменить подписку?*"""

last_active_time_subscr = """📆 *Дата окончания*: {date}"""

next_pay_date = """📅 *Следующее списание:* {date}"""

already_active_subscr = """✅ *Твоя подписка активна*"""

add_for_temp_subscr = """_Оплати подписку, чтобы её продлить_"""

break_subscr = """❓ *Ты точно хочешь отменить свою подписку?*\n\nТекущая подписка будет действовать до *{date}*."""

succesful_break_subscr = """✅ Твоя подписка успешно отменена."""

successful_pay_subscr = """✅ Подписка успешно активирована!"""

successful_extend_subscr = """✅ Подписка успешно продлена."""

error_pay_subscr = """⚠️ При оформлении подписки возникла ошибка. Пожалуйста, попробуй снова, либо обратись в поддержку."""

already_activated_subscr = """✅ Данный вид подписки уже активирован."""


new_subscriber_for_admins = """
У вас появился новый подписчик @{username}
Цена: {price} руб
Период оплаты: 30 дней
"""

extend_subscription_for_admins = """
Подписчик @{username} получена автоплата
Цена: {price} руб
Период оплаты: 30 дней
"""
